// 1. Реалізувати калькулятор. Вводяться 2 будь-яких дійсних числа в змінні a і b. Необхідно вивести на екран меню з пунктами:
//a + b
//a – b
//a * b
//a / b
//a % b
//При виборі відповідного пункту меню відбувається виведення результату обчислення(повинна бути перевірка ділення на 0!)
//Спробувати використати як драбинку іфів (1.1) та  свіч (1.2).
//1.1 Драбинка if-else
#include <iostream>
#include <windows.h>
using namespace std;

int main() {
    SetConsoleOutputCP(1251);

    double a;
    double b;
    int choice;

    cout << "Введіть дїйсне число, a: ";
    cin >> a;
    cout << "Введіть дійсне число, b: ";
    cin >> b;

    cout << "Оберіть операцію:\n";
    cout << "1) a + b\n";
    cout << "2) a - b\n";
    cout << "3) a * b\n";
    cout << "4) a / b\n";
    cout << "5) a % b\n";

    cin >> choice;

    if (choice == 1) {
        cout << "Результат: " << a + b << "\n";
    }
    else if (choice == 2) {
        cout << "Результат: " << a - b << "\n";
    }
    else if (choice == 3) {
        cout << "Результат: " << a * b << "\n";
    }
    else if (choice == 4) {
        if (b == 0) {
            cout << "Помилка! Ділення на 0 неможливе.\n";
        }
        else {
            cout << "Результат: " << a / b << "\n";
        }
    }
    else if (choice == 5) {

        cout << "Результат: " << (int)a % (int)b << "\n";
    }
    else {
        cout << "Невірний вибір.\n";
    }
}

//1.2 switch
#include <iostream>
#include <windows.h>
using namespace std;

int main() {
    SetConsoleOutputCP(1251);

    double a;
    double b;
    int choice;

    cout << "Введіть дїйсне число, a: ";
    cin >> a;
    cout << "Введіть дійсне число, b: ";
    cin >> b;

    cout << "Оберіть операцію:\n";
    cout << "1) a + b\n";
    cout << "2) a - b\n";
    cout << "3) a * b\n";
    cout << "4) a / b\n";
    cout << "5) a % b\n";

    cin >> choice;

    switch (choice) {
    case 1:
        cout << "Результат: " << a + b << "\n";
        break;
    case 2:
        cout << "Результат: " << a - b << "\n";
        break;
    case 3:
        cout << "Результат: " << a * b << "\n";
        break;
    case 4:
        if (b == 0) {
            cout << "Помилка! Ділення на 0 неможливе.\n";
        }
        else {
            cout << "Результат: " << a / b << "\n";
        }
        break;
    case 5:
        cout << "Результат: " << (int)a % (int)b << "\n";
        break;
    default:
        cout << "Невірний вибір.\n";
        break;
    }
}

//2. Написати гру "Хто хоче стати мільонером?". На екрані по черзі з'являються питання та варіанти відповідей.
//Неправильний вибір — гра завершена.Правильна відповідь — переходимо до наступного питання.
//Якщо всі відповіді правильні — в кінці виводиться повідомлення про перемогу.За бажанням можна реалізувати незгоряючі суми,
//підказки, звукові ефекти* і т.д.
#include <iostream>
#include <windows.h>
using namespace std;

int main() {
    SetConsoleOutputCP(1251);

    int score = 0;
    char choice;

    cout << "Вітаємо в нашій інтелектуальній грі - Хто хоче стати мільонером?\n";
    cout << "Переходимо до питань.\n\n";

    cout << "1. Якщо ви не знаєте як робити домашнє завдання, що ви оберете?\n";
    cout << "A) Напишете звернення до президента з проханням допомогти;\n";
    cout << "B) Виконаєте завдання на швидкість і на удачу за допомогою нейромереж;\n";
    cout << "C) Запитаєте у кота, він точно знає, що робити;\n";
    cout << "D) Передивитесь відео-матеріали, презентації та навчальну літературу з даної теми, та зробите її самостійно.\n";
    cout << "Вибір: ";
    cin >> choice;

    if (choice == 'D' || choice == 'd') {
        score++;
        cout << "Правильна відповідь!\n";
    }
    else {
        cout << "Неправильна відповідь! Гра завершена.\n";
        return 0;
    }

    cout << "2. Що робити, якщо зламався ваш улюблений гаджет?\n";
    cout << "A) Нічого не робити і чекати, поки гаджет сам себе полагодить;\n";
    cout << "B) Вимкнути та вімкнути гаджет;\n";
    cout << "C) Вімкнути режим 'ти ж програміста' та спробувати полагодити власноруч;\n";
    cout << "D) Знайти причину поломки і звернутися до фахівця для ремонту.\n";
    cout << "Вибір: ";
    cin >> choice;

    if (choice == 'D' || choice == 'd') {
        score++;
        cout << "Правильна відповідь!\n";
    }
    else {
        cout << "Неправильна відповідь! Гра завершена.\n";
        return 0;
    }

    cout << "3. Що робити, якщо ви випадково загубили ключі від дому?\n";
    cout << "A) Звернутися до екстрасенса і попросити його шукати ключі;\n";
    cout << "B) Придбати нову домівку;\n";
    cout << "C) Спокійно перевірити всі кишені та сумки, а також звернутися до близьких за допомогою;\n";
    cout << "D) Втратити свідомість.\n";
    cout << "Вибір: ";
    cin >> choice;

    if (choice == 'C' || choice == 'c') {
        score++;
        cout << "Правильна відповідь!\n";
    }
    else {
        cout << "Неправильна відповідь! Гра завершена.\n";
        return 0;
    }

    cout << "4. Якщо ви забули важливу дату, що робити?\n";
    cout << "A) Покинути країну;\n";
    cout << "B) Притворитися мертвим;\n";
    cout << "C) Написати листа президенту, про офіційну зміну цієї дати, на ту коли ви згадали;\n";
    cout << "D) Підготувати подарунок і вибачення, щоб швидко виправити ситуацію.\n";
    cout << "Вибір: ";
    cin >> choice;

    if (choice == 'D' || choice == 'd') {
        score++;
        cout << "Правильна відповідь!\n";
    }
    else {
        cout << "Неправильна відповідь! Гра завершена.\n";
        return 0;
    }

    cout << "5. Як ви обираєте ідеальну каву для ранку?\n";
    cout << "A) Обираєте каву та пропорції, які найкраще допомагають прокинутись і почати день;\n";
    cout << "B) Обираєте каву за принципом 'чим більше, тим краще';\n";
    cout << "C) Не встигаєте випити каву, тому що проспали;\n";
    cout << "D) Кип'ятите воду, але після цього забуваєте, для чого вона була потрібна.\n";
    cout << "Вибір: ";
    cin >> choice;

    if (choice == 'A' || choice == 'a') {
        score++;
        cout << "Правильна відповідь!\n";
    }
    else {
        cout << "Неправильна відповідь! Гра завершена.\n";
        return 0;
    }

    if (score == 5) {
        cout << "Вітаємо, ви виграли гру! Ви відповіли на всі питання правильно.\n";
    }

    return 0;
}


//3. Реалізувати програму «Мольфар 4000». Користувач вводить питання. Програма дає випадкову відповідь з набору заздалегідь
//передбачених відповідей(5 позитивних, 5 негативних, 10 нейтральних варіантів).
#include <iostream>
#include <windows.h>
using namespace std;

int main() {
    SetConsoleOutputCP(1251);

    srand(time(0));

    string question;
    cout << "Задайте своє питання: ";
    cin >> question;

    int randomChoice = rand() % 20;
    if (randomChoice < 5) {
        if (randomChoice == 0) {
            cout << "Так, звичайно!\n";
        }
        else if (randomChoice == 1) {
            cout << "Все буде добре, а дату краще не уточнювати!\n";
        }
        else if (randomChoice == 2) {
            cout << "Удача сьогодні на вашому боці!\n";
        }
        else if (randomChoice == 3) {
            cout << "Це правильно, продовжуйте!\n";
        }
        else if (randomChoice == 4) {
            cout << "Ви на вірному шляху!\n";
        }
    }
    else if (randomChoice < 10) {
        if (randomChoice == 5) {
            cout << "Не сподівайтесь на це.\n";
        }
        else if (randomChoice == 6) {
            cout << "Це не те, що ви шукаєте.\n";
        }
        else if (randomChoice == 7) {
            cout << "Ні, цього не станеться.\n";
        }
        else if (randomChoice == 8) {
            cout << "Ви намагаєтесь досягти неможливого.\n";
        }
        else if (randomChoice == 9) {
            cout << "Це погана ідея.\n";
        }
    }
    else {
        if (randomChoice == 10) {
            cout << "Це може статися, але не варто сподіватися.\n";
        }
        else if (randomChoice == 11) {
            cout << "Можливо.\n";
        }
        else if (randomChoice == 12) {
            cout << "Все може змінитися.\n";
        }
        else if (randomChoice == 13) {
            cout << "Є шанси.\n";
        }
        else if (randomChoice == 14) {
            cout << "Все може бути, але це не гарантовано.\n";
        }
        else if (randomChoice == 15) {
            cout << "Спитай ще раз.\n";
        }
        else if (randomChoice == 16) {
            cout << "Не можна сказати напевно.\n";
        }
        else if (randomChoice == 17) {
            cout << "Ваша ситуація має багато можливих варіантв.\n";
        }
        else if (randomChoice == 18) {
            cout << "Час покаже, що буде далі.\n";
        }
        else if (randomChoice == 19) {
            cout << "Все залежить від обставин.\n";
        }
    }
}
